read -sv out/j2c.v out/counter.v
hierarchy -top j2c

# the high-level stuff
proc; fsm; opt; memory; opt

# mapping to internal cell library
techmap; opt

# mapping flip-flops to cells.lib
dfflibmap -liberty cells.lib

# mapping logic to cells.lib
abc -liberty cells.lib

# cleanup
clean

write_verilog out/synth_j2c.v
